zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1012SG01064.atdf
          </instance>
          <instance name="ICB_NS">
            <register-group name="ICB_NS" name-in-module="ICB" address-space="base" offset="0xE002E000"/>
          </instance>
        </module>
        <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x4480C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38" caption="Instance index for IDAU"/>
              <param name="MCLK_ID_APB" value="69" caption="Index for IDAU APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for IDAU registers write protection"/>
              <param name="GRANULARITY_ANSC" value="0x1000" caption="Application Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_ANS" value="0x1000" caption="Application Non-Secure region granularity"/>
              <param name="GRANULARITY_AS" value="0x1000" caption="Application Secure region granularity"/>
              <param name="GRANULARITY_RS" value="0x1000" caption="RAM Secure region granularity"/>
              <param name="GRANULARITY_RNS" value="0x1000" caption="RAM Non-Secure region granularity"/>
              <param name="GRANULARITY_BNSC" value="0x1000" caption="Boot Flash Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_BOOTPROT" value="0x1000" caption="BOOTPROT region granularity"/>
              <param name="GRANULARITY_BS" value="0x1000" caption="Boot Flash Secure region granularity"/>
              <param name="REGION_CMCCDS" value="0x01" caption="CMCC DATA RAM Secure region ID"/>
              <param name="REGION_CMCCTS" value="0x02" caption="CMCC TAG RAM Secure region ID"/>
              <param name="REGION_CMCCVS" value="0x03" caption="CMCC VALID RAM Secure region ID"/>
              <param name="REGION_BOOTROM" value="0x04" caption="Boot ROM region ID"/>
              <param name="REGION_BS" value="0x05" caption="Boot Flash Secure region ID"/>
              <param name="REGION_BNSC" value="0x06" caption="Boot Flash Non-Secure Callable region ID"/>
              <param name="REGION_CFMS" value="0x07" caption="CONFIGURATION Flash Secure region ID"/>
              <param name="REGION_AS" value="0x08" caption="Application Secure region ID"/>
              <param name="REGION_ANSC" value="0x09" caption="Application Non-Secure Callable region ID"/>
              <param name="REGION_ANS" value="0x0A" caption="Application Non-Secure region ID"/>
              <param name="REGION_RS" value="0x0D" caption="RAM Secure region ID"/>
              <param name="REGION_RNS" value="0x0E" caption="RAM Non-Secure region ID"/>
              <param name="REGION_HPB0" value="0x0F" caption="Peripheral Bus A region ID"/>
              <param name="REGION_HPB1" value="0x10" caption="Peripheral Bus B region ID"/>
              <param name="REGION_HPB2" value="0x11" caption="Peripheral Bus C region ID"/>
              <param name="RESERVED" value="0x12" caption="RESERVED"/>
              <param name="REGION_HSM" value="0x13" caption="HSM region ID"/>
              <param name="REGION_OTHER" value="0x00" caption="Other region ID"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x44012000"/>
            <parameters>
              <param name="DIV_CLK_NUM" value="1"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="41" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MCRAMC" id="04921" name2="drm_mcramc_v5" version="5b0">
          <instance name="FLEXRAM">
            <register-group name="FLEXRAM" name-in-module="MCRAMC" address-space="base" offset="0x44028000"/>
            <parameters>
              <param name="AHB_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="AHB_ECC" value="1" caption="ECC LOGIC"/>
              <param name="AHB_PORTS_NB" value="5" caption="NUMBER OF AHB PORTS"/>
              <param name="AHB_READ_PREBUFFERING" value="0" caption="AHB READ PREBUFFERING"/>
              <param name="AHB_REQUEST_ISOLATION_REGISTER" value="0" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="ARBITRATION_TYPE" value="2" caption="ARBITRATION SCHEME, FIXED_PRIORITY = 0, HIGHLIGHT = 1, HOPSCOTCH = 2"/>
              <param name="BIT_STROBE_RAM" value="0" caption="Set this parameter to TRUE if the ram_wem_bundle outputs are connected to ram bit-strobe write masks"/>
              <param name="CHANNELS_NB" value="2" caption="NUMBER OF RAM CHANNELS"/>
              <param name="ECC_SYNDROM_REGISTER" value="0" caption="ECC TIMING PATH BALANCING"/>
              <param name="HADDR_READ_ISOLATION_REGISTER" value="0" caption="Set to IMPLEMENTED to add 1 wait-state max (0 min) per memory new line read access for each of the AHB timing path isolations"/>
              <param name="HRDATA_ISOLATION_CONFIGURABLE" value="0" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="HRDATA_ISOLATION_DEFAULT" value="0" caption="Default HRDATA_ISOLATION setting"/>
              <param name="CLK_GATER" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="PADDR_SIZE" value="13" caption="APB USER INTERFACE"/>
              <param name="MEMORY_AUTO_CORRECTION" value="1" caption="Perform an automatic write-back of the corrected ram word after read"/>
              <param name="MEMORY_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is selected when ram_me is 1'b1"/>
              <param name="MW_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="MW_DATA_SIZE" value="32" caption="MW DATA BUS SIZE"/>
              <param name="MW_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE WAITED SRAM INTERFACE"/>
              <param name="M0_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="M0_DATA_SIZE" value="32" caption="M0 DATA BUS SIZE"/>
              <param name="M0_HYBRID_READ_WRITE_ACCESS" value="0" caption="M0 HYBRID SIMULTANEOUS READ + WRITE ACCESS"/>
              <param name="M0_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE 0 WS SRAM INTERFACE"/>
              <param name="PRIVILEGED_BIT_CHECK" value="0" caption="PRIVILED BIT implemented"/>
              <param name="RAM_ADD_SIZE" value="14" caption="NUMBER OF ADDRESS BITS FOR ONE CHANNEL RAM CELL"/>
              <param name="RAM_AHB_ADDRESS_OFFSET" value="0x00000" caption="RAM BLOCK AHB ADDRESS OFFSET"/>
              <param name="RAM_ERASE" value="0" caption="IMPLEMENTED if Ram erase on erase active input"/>
              <param name="STORE_BYTE_STROBE" value="0" caption="AHB byte strobes can be stored and read back through the M0 interface"/>
              <param name="ULTRA" value="1" caption="ULTRA USER INTERFACE"/>
              <param name="WP_KEY" value="0x465852" caption="KEY value"/>
              <param name="WRITE_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_we is 1'b1"/>
              <param name="WRITE_ENABLE_USED" value="1" caption="TRUE  if the Memory makes use of a global per channel ram_we write enable"/>
              <param name="WRITE_MASK_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_wem is 1'b1"/>
              <param name="WRITE_PROTECT_REGISTER" value="0" caption="WRITE Protect register implemented"/>
              <param name="INSTANCE_ID" value="20" caption="Instance index for FLEXRAM"/>
              <param name="MCLK_ID_AHB" value="7" caption="Index for FLEXRAM AHB clock"/>
              <param name="MCLK_ID_APB" value="53" caption="Index for FLEXRAM APB clock"/>
              <param name="PAC_ID" value="20" caption="Index for FLEXRAM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
