zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1012SG01064.atdf
        <register name="RBQB" offset="0x1018" rw="RW" size="4" initval="0x00000000" caption="Receive Buffer Queue Base Address">
          <bitfield name="ADDR" caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="TBQB" offset="0x101C" rw="RW" size="4" initval="0x00000000" caption="Transmit Buffer Queue Base Address">
          <bitfield name="ADDR" caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="RSR" offset="0x1020" rw="RW" size="4" initval="0x00000000" caption="Receive Status Register">
          <bitfield name="BNA" caption="Buffer Not Available" mask="0x1"/>
          <bitfield name="REC" caption="Frame Received" mask="0x2"/>
          <bitfield name="RXOVR" caption="Receive Overrun" mask="0x4"/>
          <bitfield name="HNO" caption="HRESP Not OK" mask="0x8"/>
        </register>
        <register name="ISR" offset="0x1024" rw="RW" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUCMP" caption="Tsu timer comparison" mask="0x20000000"/>
        </register>
        <register name="IER" offset="0x1028" rw="W" size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUCMP" caption="Tsu timer comparison" mask="0x20000000"/>
        </register>
        <register name="IDR" offset="0x102C" rw="W" size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUCMP" caption="Tsu timer comparison" mask="0x20000000"/>
        </register>
        <register name="IMR" offset="0x1030" rw="R" size="4" initval="0x3FFFFFFF" caption="Interrupt Mask Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="WOL" caption="Wake On Lan" mask="0x10000000"/>
          <bitfield name="TSUCMP" caption="Tsu timer comparison" mask="0x20000000"/>
        </register>
