zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1012SG01064.atdf
        <register name="FUCFG14" offset="0x78" rw="RW" size="4" access-size="4" caption="PFM IDAU Configuration">
          <bitfield name="IDAU_ANS" caption="Non-secure Flash application size" mask="0x1FF"/>
          <bitfield name="IDAU_ANSC" caption="Non-secure callable Flash application size" mask="0x10000"/>
        </register>
        <register name="FUCFG15" offset="0x7C" rw="RW" size="4" access-size="4" caption="RAM IDAU Configuration">
          <bitfield name="IDAU_RNS" caption="Non-secure RAM size" mask="0x7F"/>
        </register>
        <register name="FUCFG16" offset="0x80" rw="RW" size="4" access-size="4" caption="User Configuration 16 (HSM Firmware Metadata 0 Address)">
          <bitfield name="HSM_PTRMETA0" caption="HSM Firmware Metadata pointer 0" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUCFG24" offset="0xA0" rw="RW" size="4" access-size="4" caption="User Configuration 24 (HSM Firmware Metadata 1 Address)">
          <bitfield name="HSM_PTRMETA1" caption="HSM Firmware Metadata pointer 1" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="FUSES_CALOTP" caption="Defines FUSE parameters">
        <register name="FCCFG64" offset="0x180" rw="R" size="4" access-size="4" caption="PTC Calibration">
          <bitfield name="PTCFG0" caption="" mask="0xFFFF"/>
        </register>
        <register name="FCCFG65" offset="0x184" rw="R" size="4" access-size="4" caption="ADC Calibration">
          <bitfield name="ADCFG0" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="FCCFG66" offset="0x188" rw="R" size="4" access-size="4" caption="Comparator Calibration">
          <bitfield name="ACPAIR_SEL" caption="" mask="0xFF"/>
        </register>
        <register name="FCCFG69" offset="0x194" rw="R" size="4" access-size="4" caption="Temperature  calibration values 0">
          <bitfield name="ROOM_ADC_VAL_PTAT" caption="" mask="0xFFF"/>
          <bitfield name="ROOM_ADC_VAL_BUFF1V2" caption="" mask="0xFFF000"/>
          <bitfield name="ROOM_TEMP_VAL_INT" caption="" mask="0xFF000000"/>
        </register>
        <register name="FCCFG70" offset="0x198" rw="R" size="4" access-size="4" caption="Temperature  calibration values 1">
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="" mask="0xF"/>
          <bitfield name="ROOM_VREF_VAL" caption="" mask="0xFFF0"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="" mask="0xF0000"/>
          <bitfield name="Reserved" caption="" mask="0xFFF00000"/>
        </register>
        <register name="FCCFG71" offset="0x19C" rw="R" size="4" access-size="4" caption="Temperature  calibration values 2">
          <bitfield name="HOT_ADC_VAL_PTAT" caption="" mask="0xFFF"/>
          <bitfield name="HOT_ADC_VAL_BUFF1V2" caption="" mask="0xFFF000"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="" mask="0xFF000000"/>
        </register>
        <register name="FCCFG72" offset="0x1A0" rw="R" size="4" access-size="4" caption="MAC ID (31 through 0)">
          <bitfield name="FMAC_31_0" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="FCCFG73" offset="0x1A4" rw="R" size="4" access-size="4" caption="MAC ID (47 through 32)">
          <bitfield name="FMAC_47_32" caption="" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="BLDRCFG__BROM_EN_BFMCHK">
        <value name="NONE" caption="No verification" value="0x0"/>
        <value name="CRC32" caption="Verify using crc32" value="0x1"/>
      </value-group>
      <value-group name="DAL__CPU0">
        <value name="DAL0" caption="FCW_DAL0_VALUE" value="0x81"/>
        <value name="DAL1" caption="FCW_DAL1_VALUE" value="0x99"/>
        <value name="DAL2" caption="FCW_DAL2_VALUE" value="0xDB"/>
      </value-group>
      <value-group name="DAL__CPU1">
        <value name="DAL0" caption="FCW_DAL0_VALUE" value="0x81"/>
        <value name="DAL1" caption="FCW_DAL1_VALUE" value="0x99"/>
        <value name="DAL2" caption="FCW_DAL2_VALUE" value="0xDB"/>
      </value-group>
    </module>
    <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bit" mask="0x400"/>
          <bitfield name="GENCTRL9" caption="Generic Clock Generator Control 9 Synchronization Busy bit" mask="0x800"/>
          <bitfield name="GENCTRL10" caption="Generic Clock Generator Control 10 Synchronization Busy bit" mask="0x1000"/>
          <bitfield name="GENCTRL11" caption="Generic Clock Generator Control 11 Synchronization Busy bit" mask="0x2000"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="12" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
